Revit 2026 API

# TableViewIsValidSectionType Method

---

Identifies if the section type is valid for this view.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public bool IsValidSectionType(
	SectionType sectionType
)
```
```vb
Public Function IsValidSectionType (
	sectionType As SectionType
) As Boolean
```
```cpp
public:
bool IsValidSectionType(
	SectionType sectionType
)
```
```fsharp
member IsValidSectionType :
        sectionType : SectionType -> bool
```

#### Parameters

sectionType SectionType
     The section type.

#### Return Value

Boolean True if the Section Type is valid, false otherwise.

| Exception | Condition |
| --- | --- |
| ArgumentOutOfRangeException | A value passed for an enumeration argument is not a member of that enumeration |

Some TableViews do not contain all of the possible section types. For example, standard schedules have only a Heading and Body.

#### Reference

TableView Class

Autodesk.Revit.DB Namespace